return {
  "folke/snacks.nvim",
  opts = {
    dashboard = {
      preset = {
        header = [[
 █████   ████                    ████                    
▒▒███   ███▒                    ▒▒███                    
 ▒███  ███     ██████  ████████  ▒███   ██████  ████████ 
 ▒███████     ███▒▒███▒▒███▒▒███ ▒███  ███▒▒███▒▒███▒▒███
 ▒███▒▒███   ▒███████  ▒███ ▒███ ▒███ ▒███████  ▒███ ▒▒▒ 
 ▒███ ▒▒███  ▒███▒▒▒   ▒███ ▒███ ▒███ ▒███▒▒▒   ▒███     
 █████ ▒▒████▒▒██████  ▒███████  █████▒▒██████  █████    
▒▒▒▒▒   ▒▒▒▒  ▒▒▒▒▒▒   ▒███▒▒▒  ▒▒▒▒▒  ▒▒▒▒▒▒  ▒▒▒▒▒     
                       ▒███                              
                       █████                             
                      ▒▒▒▒▒                              ]],
        keys = {
          { icon = "\u{f0e7} ", key = "f", desc = "Find File", action = ":lua Snacks.dashboard.pick('files')" },
          { icon = "\u{f15b} ", key = "n", desc = "New File", action = ":ene | startinsert" },
          { icon = "\u{f07c} ", key = "p", desc = "Projects", action = ":lua Snacks.dashboard.pick('projects')" },
          { icon = "\u{f002} ", key = "g", desc = "Find Text", action = ":lua Snacks.dashboard.pick('live_grep')" },
          { icon = "\u{f0c5} ", key = "r", desc = "Recent Files", action = ":lua Snacks.dashboard.pick('oldfiles')" },
          {
            icon = "\u{f013} ",
            key = "c",
            desc = "Config",
            action = ":lua Snacks.dashboard.pick('files', {cwd = vim.fn.stdpath('config')})",
          },
          { icon = "\u{f487} ", key = "L", desc = "Lazy", action = ":Lazy" },
          { icon = "\u{f08b} ", key = "q", desc = "Quit", action = ":qa" },
        },
      },
    },
  },
}
