return {
  "folke/snacks.nvim",
  opts = {
    dashboard = {
      preset = {
        header = [[
 █████   ████                    ████                    
▒▒███   ███▒                    ▒▒███                    
 ▒███  ███     ██████  ████████  ▒███   ██████  ████████ 
 ▒███████     ███▒▒███▒▒███▒▒███ ▒███  ███▒▒███▒▒███▒▒███
 ▒███▒▒███   ▒███████  ▒███ ▒███ ▒███ ▒███████  ▒███ ▒▒▒ 
 ▒███ ▒▒███  ▒███▒▒▒   ▒███ ▒███ ▒███ ▒███▒▒▒   ▒███     
 █████ ▒▒████▒▒██████  ▒███████  █████▒▒██████  █████    
▒▒▒▒▒   ▒▒▒▒  ▒▒▒▒▒▒   ▒███▒▒▒  ▒▒▒▒▒  ▒▒▒▒▒▒  ▒▒▒▒▒     
                       ▒███                              
                       █████                             
                      ▒▒▒▒▒                              ]],
      },
      keys = {
        { icon = " ", key = "f", desc = "Find File", action = ":lua Snacks.dashboard.pick('files')" },
        { icon = " ", key = "r", desc = "Recent Files", action = ":lua Snacks.dashboard.pick('oldfiles')" },
        { icon = " ", key = "p", desc = "Projects", action = ":lua Snacks.dashboard.pick('projects')" },
        {
          icon = " ",
          key = "c",
          desc = "Config",
          action = ":lua Snacks.dashboard.pick('files', {cwd = vim.fn.stdpath('config')})",
        },
        { icon = " ", key = "L", desc = "Lazy", action = ":Lazy" },
        { icon = " ", key = "q", desc = "Quit", action = ":qa" },
      },
    },
  },
}
